### Terraform Plan 📋
```
module.eks.data.aws_partition.current[0]: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks_managed_node_group["infra"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["app"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["infra"].data.aws_partition.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_availability_zones.available: Reading...
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::760033296418:oidc-provider/token.actions.githubusercontent.com]
aws_iam_policy.alb_controller: Refreshing state... [id=arn:aws:iam::760033296418:policy/eks-obs-dev-alb-controller-policy]
module.eks.module.eks_managed_node_group["app"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.eks_managed_node_group["infra"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_managed_node_group["infra"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-033296f5a7c168920]
module.eks.module.eks_managed_node_group["app"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["app"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["infra"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["app"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-obs-dev/cluster]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=eks-obs-dev-cluster-20260322032324082700000001]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=760033296418]
module.eks.module.eks_managed_node_group["app"].aws_iam_role.this[0]: Refreshing state... [id=app-eks-node-group-20260322032324083000000003]
module.eks.module.eks_managed_node_group["infra"].aws_iam_role.this[0]: Refreshing state... [id=infra-eks-node-group-20260322032324082900000002]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=760033296418]
data.aws_iam_policy_document.github_actions_assume: Reading...
data.aws_iam_policy_document.github_actions_assume: Read complete after 0s [id=1893162052]
module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
aws_iam_role.github_actions: Refreshing state... [id=eks-obs-dev-github-actions]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::760033296418:assumed-role/eks-obs-dev-github-actions/GitHubActions]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::760033296418:policy/eks-obs-dev-cluster-20260322032324083600000004]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-obs-dev-cluster-20260322032324082700000001-2026032203232635000000000c]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-obs-dev-cluster-20260322032324082700000001-2026032203232637540000000d]
module.eks.module.eks_managed_node_group["app"].data.aws_caller_identity.current: Read complete after 0s [id=760033296418]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=119539944]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=9e04a77d-74c6-470e-8eee-31279c440423]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=eks-obs-dev-cluster-20260322032324082700000001-2026032203232634340000000b]
aws_iam_role_policy_attachment.github_actions: Refreshing state... [id=eks-obs-dev-github-actions-20260322033725176500000001]
data.aws_caller_identity.current: Read complete after 0s [id=760033296418]
module.eks.module.eks_managed_node_group["infra"].data.aws_caller_identity.current: Read complete after 0s [id=760033296418]
module.eks.module.eks_managed_node_group["app"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=app-eks-node-group-20260322032324083000000003-20260322032326020400000005]
module.eks.module.eks_managed_node_group["app"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=app-eks-node-group-20260322032324083000000003-20260322032326095500000009]
module.eks.module.eks_managed_node_group["app"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=app-eks-node-group-20260322032324083000000003-20260322032326054700000007]
module.eks.module.eks_managed_node_group["infra"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=infra-eks-node-group-20260322032324082900000002-20260322032326038300000006]
module.eks.module.eks_managed_node_group["infra"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=infra-eks-node-group-20260322032324082900000002-2026032203232632100000000a]
module.eks.module.eks_managed_node_group["infra"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=infra-eks-node-group-20260322032324082900000002-20260322032326095500000008]
data.aws_availability_zones.available: Read complete after 0s [id=ap-northeast-1]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-obs-dev]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::760033296418:policy/eks-obs-dev-cluster-ClusterEncryption20260322032347428600000013]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-obs-dev-cluster-20260322032324082700000001-20260322032348603600000014]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-07121bfd27bb5d756]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-03ef350d88939fcde]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ffa41bf15cbebb21]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-082c7ce4dc39e9515]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0907fe8d6abd6768f]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-066da6b0ab694448e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0795a0ff032b8fc89]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0120f2dbee5518978]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a8028f5d89eade70]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0451debd151d27b08]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0e1979746e644e492]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-01238a057e7968739]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e83bc17c00dd246d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e43e90570b48760d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0795a0ff032b8fc891080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0d7d45cdb9cdaebb7]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2080331057]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-3907357385]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-510847432]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3123530279]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-172965315]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3494995572]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3272432213]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1493133352]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3035649471]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1898717591]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-2670317798]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-048882da385973e8c]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0029a119c11fd4636]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0715348fb2da85128]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01306de955be012f7]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-035c37149ab59096e]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b4ac31b69c4aeec6]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0501ecfbe2080a390]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a8028f5d89eade701080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-obs-dev]
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=eks-obs-dev:arn:aws:iam::760033296418:role/eks-obs-dev-github-actions]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.time_sleep.this[0]: Refreshing state... [id=2026-03-22T03:32:47Z]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0c7bf4a85a98f8ab4,Project]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0c7bf4a85a98f8ab4,Environment]
module.eks.aws_ec2_tag.cluster_primary_security_group["ManagedBy"]: Refreshing state... [id=sg-0c7bf4a85a98f8ab4,ManagedBy]
module.eks.module.eks_managed_node_group["app"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=7931435753779462607]
module.eks.module.eks_managed_node_group["infra"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=6622477176283837235]
module.eks.module.eks_managed_node_group["infra"].aws_launch_template.this[0]: Refreshing state... [id=lt-01ad31969b2d03b07]
module.eks.module.eks_managed_node_group["app"].aws_launch_template.this[0]: Refreshing state... [id=lt-0525f50b855361df0]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.module.eks_managed_node_group["app"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-obs-dev:app-2026032203325330220000001d]
module.eks.module.eks_managed_node_group["infra"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-obs-dev:infra-2026032203325330210000001b]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=eks-obs-dev#arn:aws:iam::760033296418:role/eks-obs-dev-github-actions#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=689b51723c82af77175806a2eda17f8b81260588]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::760033296418:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/32B9B0E8EF09B5190402CFBC9A221FF5]
data.aws_iam_policy_document.alb_controller_assume: Reading...
data.aws_iam_policy_document.prometheus_assume: Reading...
data.aws_iam_policy_document.alb_controller_assume: Read complete after 0s [id=3509686325]
data.aws_iam_policy_document.prometheus_assume: Read complete after 0s [id=177513794]
aws_iam_role.alb_controller: Refreshing state... [id=eks-obs-dev-alb-controller]
aws_iam_role.prometheus: Refreshing state... [id=eks-obs-dev-prometheus]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-obs-dev:vpc-cni]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-obs-dev:kube-proxy]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-obs-dev:coredns]
aws_iam_role_policy_attachment.alb_controller: Refreshing state... [id=eks-obs-dev-alb-controller-20260322033220336000000016]
aws_iam_role_policy_attachment.prometheus: Refreshing state... [id=eks-obs-dev-prometheus-20260322033220318300000015]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks.aws_eks_access_entry.this["admin_user"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "eks-obs-dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::760033296418:user/admin"
      + tags              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "eks-obs"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "eks-obs"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.this["admin_user_cluster_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "eks-obs-dev"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::760033296418:user/admin"

      + access_scope {
          + type = "cluster"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```
*Plan result: success*